Ran Plan for dir: `terragrunt/kubernetes/longhorn` workspace: `terragrunt_kubernetes_longhorn`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' 'terragrunt plan -input=false $(printf '%s' $COMMENT_ARGS | sed 's/,/ /g' | tr -d '\\') -no-color -out $PLANFILE' in '/home/atlantis/.atlantis/repos/youhide/hideForming/120/terragrunt_kubernetes_longhorn/terragrunt/kubernetes/longhorn': exit status 1: running "terragrunt plan -input=false $(printf '%s' $COMMENT_ARGS | sed 's/,/ /g' | tr -d '\\\\') -no-color -out $PLANFILE" in "/home/atlantis/.atlantis/repos/youhide/hideForming/120/terragrunt_kubernetes_longhorn/terragrunt/kubernetes/longhorn": 
01:00:20.847 INFO   [../../openmediavault/minio] Downloading Terraform configurations from ../../../modules/terraform/minio into ../../openmediavault/minio/.terragrunt-cache/UlLHXn3rLb9_NpSxQg2JenC3Cm0/AW6xMOLbU27argYGM-zIWTxXCv8
01:00:20.868 INFO   [../../openmediavault/minio] tofu: Initializing the backend...
01:00:20.898 INFO   [../../openmediavault/minio] tofu: 
01:00:20.898 INFO   [../../openmediavault/minio] tofu: Successfully configured the backend "s3"! OpenTofu will automatically
01:00:20.898 INFO   [../../openmediavault/minio] tofu: use this backend unless the backend configuration changes.
01:00:20.916 INFO   [../../openmediavault/minio] tofu: Initializing provider plugins...
01:00:20.916 INFO   [../../openmediavault/minio] tofu: - Reusing previous version of hashicorp/vault from the dependency lock file
01:00:21.234 INFO   [../../openmediavault/minio] tofu: - Reusing previous version of telmate/proxmox from the dependency lock file
01:00:21.514 INFO   [../../openmediavault/minio] tofu: - Reusing previous version of hashicorp/kubernetes from the dependency lock file
01:00:21.824 INFO   [../../openmediavault/minio] tofu: - Reusing previous version of hashicorp/helm from the dependency lock file
01:00:22.123 INFO   [../../openmediavault/minio] tofu: - Reusing previous version of goauthentik/authentik from the dependency lock file
01:00:22.428 INFO   [../../openmediavault/minio] tofu: - Reusing previous version of gavinbunney/kubectl from the dependency lock file
01:00:23.048 INFO   [../../openmediavault/minio] tofu: - Reusing previous version of aminueza/minio from the dependency lock file
01:00:23.365 INFO   [../../openmediavault/minio] tofu: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
01:00:24.781 INFO   [../../openmediavault/minio] tofu: - Installing hashicorp/vault v4.8.0...
01:00:26.036 INFO   [../../openmediavault/minio] tofu: - Installed hashicorp/vault v4.8.0 (signed, key ID 0C0AF313E5FD9F80)
01:00:27.307 INFO   [../../openmediavault/minio] tofu: - Installing telmate/proxmox v3.0.1-rc8...
01:00:28.287 INFO   [../../openmediavault/minio] tofu: - Installed telmate/proxmox v3.0.1-rc8. Signature validation was skipped due to the registry not containing GPG keys for this provider
01:00:29.459 INFO   [../../openmediavault/minio] tofu: - Installing hashicorp/kubernetes v2.36.0...
01:00:31.108 INFO   [../../openmediavault/minio] tofu: - Installed hashicorp/kubernetes v2.36.0 (signed, key ID 0C0AF313E5FD9F80)
01:00:32.657 INFO   [../../openmediavault/minio] tofu: - Installing hashicorp/helm v3.0.0-pre2...
01:00:34.682 INFO   [../../openmediavault/minio] tofu: - Installed hashicorp/helm v3.0.0-pre2 (signed, key ID 0C0AF313E5FD9F80)
01:00:36.217 INFO   [../../openmediavault/minio] tofu: - Installing goauthentik/authentik v2025.8.1...
01:00:37.520 INFO   [../../openmediavault/minio] tofu: - Installed goauthentik/authentik v2025.8.1. Signature validation was skipped due to the registry not containing GPG keys for this provider
01:00:38.564 INFO   [../../openmediavault/minio] tofu: - Installing gavinbunney/kubectl v1.19.0...
01:00:40.254 INFO   [../../openmediavault/minio] tofu: - Installed gavinbunney/kubectl v1.19.0 (signed, key ID 1E1CE42504F5FBB2)
01:00:41.548 INFO   [../../openmediavault/minio] tofu: - Installing aminueza/minio v3.5.0...
01:00:42.719 INFO   [../../openmediavault/minio] tofu: - Installed aminueza/minio v3.5.0. Signature validation was skipped due to the registry not containing GPG keys for this provider
01:00:44.220 INFO   [../../openmediavault/minio] tofu: - Installing cloudflare/cloudflare v5.4.0...
01:00:47.556 INFO   [../../openmediavault/minio] tofu: - Installed cloudflare/cloudflare v5.4.0 (signed, key ID C76001609EE3B136)
01:00:47.556 INFO   [../../openmediavault/minio] tofu: Providers are signed by their developers.
01:00:47.556 INFO   [../../openmediavault/minio] tofu: If you'd like to know more about provider signing, you can read about it here:
01:00:47.556 INFO   [../../openmediavault/minio] tofu: https://opentofu.org/docs/cli/plugins/signing/
01:00:47.556 INFO   [../../openmediavault/minio] tofu: OpenTofu has made some changes to the provider dependency selections recorded
01:00:47.556 INFO   [../../openmediavault/minio] tofu: in the .terraform.lock.hcl file. Review those changes and commit them to your
01:00:47.556 INFO   [../../openmediavault/minio] tofu: version control system if they represent changes you intended to make.
01:00:47.557 INFO   [../../openmediavault/minio] tofu: OpenTofu has been successfully initialized!
01:00:47.930 INFO   Downloading Terraform configurations from . into ./.terragrunt-cache/0i4WUm3tDfSdF50RpUReC6QMmQc/569lDxzG6GxUma2x--eUhNEJ1nc
01:00:47.972 INFO   tofu: Initializing the backend...
01:00:47.996 INFO   tofu: Successfully configured the backend "s3"! OpenTofu will automatically
01:00:47.996 INFO   tofu: use this backend unless the backend configuration changes.
01:00:48.017 INFO   tofu: Initializing provider plugins...
01:00:48.017 INFO   tofu: - Reusing previous version of gavinbunney/kubectl from the dependency lock file
01:00:48.202 INFO   tofu: - Reusing previous version of aminueza/minio from the dependency lock file
01:00:48.321 INFO   tofu: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
01:00:48.478 INFO   tofu: - Reusing previous version of hashicorp/vault from the dependency lock file
01:00:48.615 INFO   tofu: - Reusing previous version of telmate/proxmox from the dependency lock file
01:00:48.710 INFO   tofu: - Reusing previous version of hashicorp/kubernetes from the dependency lock file
01:00:48.832 INFO   tofu: - Reusing previous version of hashicorp/helm from the dependency lock file
01:00:48.934 INFO   tofu: - Reusing previous version of goauthentik/authentik from the dependency lock file
01:00:49.322 INFO   tofu: - Installing hashicorp/kubernetes v2.36.0...
01:00:50.721 INFO   tofu: - Installed hashicorp/kubernetes v2.36.0 (signed, key ID 0C0AF313E5FD9F80)
01:00:50.983 INFO   tofu: - Installing hashicorp/helm v3.0.0-pre2...
01:00:52.602 INFO   tofu: - Installed hashicorp/helm v3.0.0-pre2 (signed, key ID 0C0AF313E5FD9F80)
01:00:52.870 INFO   tofu: - Installing goauthentik/authentik v2025.8.1...
01:00:53.631 INFO   tofu: - Installed goauthentik/authentik v2025.8.1. Signature validation was skipped due to the registry not containing GPG keys for this provider
01:00:53.903 INFO   tofu: - Installing gavinbunney/kubectl v1.19.0...
01:00:55.170 INFO   tofu: - Installed gavinbunney/kubectl v1.19.0 (signed, key ID 1E1CE42504F5FBB2)
01:00:55.434 INFO   tofu: - Installing aminueza/minio v3.5.0...
01:00:56.080 INFO   tofu: - Installed aminueza/minio v3.5.0. Signature validation was skipped due to the registry not containing GPG keys for this provider
01:00:56.315 INFO   tofu: - Installing cloudflare/cloudflare v5.4.0...
01:00:58.431 INFO   tofu: - Installed cloudflare/cloudflare v5.4.0 (signed, key ID C76001609EE3B136)
01:00:58.641 INFO   tofu: - Installing hashicorp/vault v4.8.0...
01:00:59.431 INFO   tofu: - Installed hashicorp/vault v4.8.0 (signed, key ID 0C0AF313E5FD9F80)
01:00:59.657 INFO   tofu: - Installing telmate/proxmox v3.0.1-rc8...
01:01:00.224 INFO   tofu: - Installed telmate/proxmox v3.0.1-rc8. Signature validation was skipped due to the registry not containing GPG keys for this provider
01:01:00.224 INFO   tofu: Providers are signed by their developers.
01:01:00.224 INFO   tofu: If you'd like to know more about provider signing, you can read about it here:
01:01:00.224 INFO   tofu: https://opentofu.org/docs/cli/plugins/signing/
01:01:00.224 INFO   tofu: OpenTofu has made some changes to the provider dependency selections recorded
01:01:00.224 INFO   tofu: in the .terraform.lock.hcl file. Review those changes and commit them to your
01:01:00.224 INFO   tofu: version control system if they represent changes you intended to make.
01:01:00.224 INFO   tofu: OpenTofu has been successfully initialized!
01:01:01.213 STDOUT tofu: vault_generic_secret.longhorn_secrets: Refreshing state... [id=secret/TF-Longhorn-s3-keys]
01:01:01.214 STDOUT tofu: kubernetes_namespace.longhorn_system: Refreshing state... [id=longhorn-system]
01:01:01.978 STDOUT tofu: kubernetes_manifest.longhorn_external_secret: Refreshing state...
01:01:02.242 STDOUT tofu: helm_release.longhorn: Refreshing state... [id=longhorn]
01:01:02.981 STDOUT tofu: kubectl_manifest.longhorn_daily_backup: Refreshing state... [id=/apis/longhorn.io/v1beta2/namespaces/longhorn-system/recurringjobs/daily-backup]
01:01:05.252 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
01:01:05.252 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
01:01:05.252 STDOUT tofu:   ~ update in-place
01:01:05.252 STDOUT tofu: OpenTofu planned the following actions, but then encountered a problem:
01:01:05.252 STDOUT tofu:   # helm_release.longhorn will be updated in-place
01:01:05.252 STDOUT tofu:   ~ resource "helm_release" "longhorn" {
01:01:05.252 STDOUT tofu:       ~ id                         = "longhorn" -> (known after apply)
01:01:05.252 STDOUT tofu:       ~ metadata                   = {
01:01:05.252 STDOUT tofu:           ~ app_version    = "v1.11.0" -> (known after apply)
01:01:05.252 STDOUT tofu:           ~ chart          = "longhorn" -> (known after apply)
01:01:05.252 STDOUT tofu:           ~ first_deployed = 1759114852 -> (known after apply)
01:01:05.252 STDOUT tofu:           ~ last_deployed  = 1769736672 -> (known after apply)
01:01:05.253 STDOUT tofu:           ~ name           = "longhorn" -> (known after apply)
01:01:05.253 STDOUT tofu:           ~ namespace      = "longhorn-system" -> (known after apply)
01:01:05.253 STDOUT tofu:           ~ revision       = 3 -> (known after apply)
01:01:05.253 STDOUT tofu:           ~ values         = jsonencode(
01:01:05.253 STDOUT tofu:                 {
01:01:05.253 STDOUT tofu:                   - defaultBackupStore = {
01:01:05.253 STDOUT tofu:                       - backupTarget                 = "s3://longhorn@us-east-1/"
01:01:05.253 STDOUT tofu:                       - backupTargetCredentialSecret = "longhorn-secrets"
01:01:05.253 STDOUT tofu:                     }
01:01:05.253 STDOUT tofu:                   - defaultSettings    = {
01:01:05.253 STDOUT tofu:                       - systemManagedComponentsNodeSelector = "!node-role.kubernetes.io/master"
01:01:05.253 STDOUT tofu:                     }
01:01:05.253 STDOUT tofu:                   - longhornUI         = {
01:01:05.253 STDOUT tofu:                       - replicas = 1
01:01:05.253 STDOUT tofu:                     }
01:01:05.253 STDOUT tofu:                   - persistence        = {
01:01:05.253 STDOUT tofu:                       - defaultClassReplicaCount = 2
01:01:05.253 STDOUT tofu:                     }
01:01:05.253 STDOUT tofu:                 }
01:01:05.253 STDOUT tofu:             ) -> (known after apply)
01:01:05.253 STDOUT tofu:           ~ version        = "1.11.0" -> (known after apply)
01:01:05.253 STDOUT tofu:         } -> (known after apply)
01:01:05.253 STDOUT tofu:         name                       = "longhorn"
01:01:05.253 STDOUT tofu:       ~ version                    = "1.11.0" -> "1.11.1"
01:01:05.253 STDOUT tofu:         # (26 unchanged attributes hidden)
01:01:05.253 STDOUT tofu:     }
01:01:05.253 STDOUT tofu: Plan: 0 to add, 1 to change, 0 to destroy.
01:01:05.252 STDERR tofu: Error: failed to lookup token, err=Error making API request.
01:01:05.252 STDERR tofu: URL: GET http://vault.localdomain:8200/v1/auth/token/lookup-self
01:01:05.252 STDERR tofu: Code: 503. Errors:
01:01:05.252 STDERR tofu: * Vault is sealed
01:01:05.252 STDERR tofu:   with vault_generic_secret.longhorn_secrets,
01:01:05.252 STDERR tofu:   on main.tf line 7, in resource "vault_generic_secret" "longhorn_secrets":
01:01:05.252 STDERR tofu:    7: resource "vault_generic_secret" "longhorn_secrets" {
01:01:05.259 ERROR  tofu invocation failed in ./.terragrunt-cache/0i4WUm3tDfSdF50RpUReC6QMmQc/569lDxzG6GxUma2x--eUhNEJ1nc
01:01:05.259 ERROR  error occurred:

* Failed to execute "tofu plan -input=false -out ./terragrunt_kubernetes_longhorn.tfplan -no-color" in ./.terragrunt-cache/0i4WUm3tDfSdF50RpUReC6QMmQc/569lDxzG6GxUma2x--eUhNEJ1nc
  
  Error: failed to lookup token, err=Error making API request.
  
  URL: GET http://vault.localdomain:8200/v1/auth/token/lookup-self
  Code: 503. Errors:
  
  * Vault is sealed
  
    with vault_generic_secret.longhorn_secrets,
    on main.tf line 7, in resource "vault_generic_secret" "longhorn_secrets":
     7: resource "vault_generic_secret" "longhorn_secrets" {
  
  
  exit status 1


Authenticated

```
</details>